WiseLabCMU/Beluga/NRFClean/nRF5_SDK_14.2.0_17b948a/examples/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
    }
}


static void led_toggle_task_function (void * pvParameter)
{
    UNUSED_PARAMETER(pvParameter);
    while (true)
    {
        bsp_board_led_invert(BSP_BOARD_LED_0);

        /* Delay a task for a given number of ticks */
        vTaskDelay(TASK_DELAY);

        /* Tasks must be implemented to never return... */
    }
}

/**@brief The function to call when the LED1 FreeRTOS timer expires.
 *
 * @param[in] pvParameter   Pointer that will be used as the parameter for the timer.
 */
static void led_toggle_timer_callback (void * pvParameter)
{
    UNUSED_PARAMETER(pvParameter);
    bsp_board_led_invert(BSP_BOARD_LED_1);
}
/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


int main(void)
{
    bool erase_bonds;

    log_init();
    timer_init();
    clock_init();
    


      
    // Start execution.
    if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    
    buttons_leds_init(&erase_bonds);


    bsp_board_leds_init();
  

    ble_version_t sd = {0,0,0};
    ble_version_t *p_version = &sd;
    uint32_t a;
    a = sd_ble_version_get(p_version);
    NRF_LOG_INFO("%d", a); 
    ble_stack_init();
    a = sd_ble_version_get(p_version);
    NRF_LOG_INFO("%d", a); 

    gap_params_init();
    gatt_init();
    conn_params_init();
    db_discovery_init();
    peer_manager_init();
    hrs_c_init();
    rscs_c_init();
    services_init();
    advertising_init();
    

    while(a != 0) {};
    
    



    UNUSED_VARIABLE(xTaskCreate(led_toggle_task_function, "LED0", configMINIMAL_STACK_SIZE + 200, NULL, 2, &led_toggle_task_handle));

    /* Start timer for LED1 blinking */
    led_toggle_timer_handle = xTimerCreate( "LED1", TIMER_PERIOD, pdTRUE, NULL, led_toggle_timer_callback);
    UNUSED_VARIABLE(xTimerStart(led_toggle_timer_handle, 0));


    
    //nrf_delay_ms(100);



    
    
    //nrf_sdh_freertos_init(scanning_start, &erase_bonds);
    
    nrf_sdh_freertos_init(advertising_start, &erase_bonds);
    
    

    //nrf_sdh_freertos_init(advertising_start, &erase_bonds);
    // Start FreeRTOS scheduler.
    NRF_LOG_INFO("Hello!");
    vTaskStartScheduler();
    while (true)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
        NRF_LOG_INFO("Hello!");
        
    }


    
}
